<doc>あらすじ</doc>

<template lang="pug">
  div
    h1.parts-pageTtl あらすじ

    p こんにちは。ウィケと申します。

    p なんちゃってヒエログリフ変換システム「ヒエログリファー」を作った経緯を書いておきます。

    p ある日会社で、オリジナルデザインのキーホルダーを作らせてもらえることになりました。

    p ちょうどそのとき、アサシンクリードオリジンズというエジプトを舞台にしたゲームにどハマりしていた私は、そのゲームに出てくる紋章をモチーフに作りたいなと考えました。

    p ところが、考えてみれば当たり前なのですが、会社の取り組みで作るものなので、版権ものはなるべく避けてねと言われてしまいました。

    p なるほど確かにねと思い、イラストレーター（デザインに使うソフトの名前）の使い方を教えてもらうも、私はしがないフロントエンドエンジニア。デザイナーさんたちのようにオリジナルデザインをサクサク生み出すことはできませんでした。

    p 頭を抱えつつもエジプトを捨てられない私は悩み、ふと思いつきました。
      br
      | ヒエログリフって文字じゃん、と。文字ならコピペできるし、そのものをデザインする必要はない。並べるだけで多分格好良い。
      br
      | 賢い。

    p そして色々と調べてるうちに、ヒエログリフはブラウザやイラストレーターでもちゃんと表示できることやアルファベットに変換できることが（どういう理論でなのかは理解していませんが）わかりました。

    p キーホルダーを作るときは、考えた文章を手動でローマ字に変換して、1文字1文字照らし合わせながらヒエログリフに変えていきました。

    p 最終的には格好良くできたので満足したのですが、2～30文字程度とはいえデザインの関係で文章を削って再変換して……を繰り返すとなかなかの手間でした。

</template>

<script></script>

<style lang="stylus" scoped>
p + p
  margin-top 16px
</style>
